Documents/омг_УстановкаВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>омг_УстановкаВыработки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.омг_НоменклатураВыработки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Филиалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьДолжностиИСотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураИсключения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоИскл</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураИсключения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/омг_НоменклатураВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_НоменклатураВыработки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураИскл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоИскл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВвода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/омг_УстановкаВыработки/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Филиалы.Количество() = 0 Тогда  
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните филиал!";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	Движения.омг_НоменклатураВыработки.Записывать = Истина;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_УстановкаВыработкиФилиалы.Филиал КАК Филиал,
		|	омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники.Должность КАК Должность,
		|	омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники.Сотрудник КАК Сотрудник,
		|	омг_УстановкаВыработкиНоменклатура.Номенклатура КАК Номенклатура,
		|	омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники.ИндСтроки КАК ИндСтроки,
		|	омг_УстановкаВыработкиФилиалы.Ссылка.Дата КАК Период,
		|	омг_УстановкаВыработкиНоменклатура.ЭтоИскл КАК ЭтоИскл,
		|	омг_УстановкаВыработкиНоменклатура.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	омг_УстановкаВыработкиФилиалы.Ссылка.Дата КАК ДатаВвода
		|ИЗ
		|	Документ.омг_УстановкаВыработки.Филиалы КАК омг_УстановкаВыработкиФилиалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.омг_УстановкаВыработки.ТабличнаяЧастьДолжностиИСотрудники КАК омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.омг_УстановкаВыработки.Номенклатура КАК омг_УстановкаВыработкиНоменклатура
		|			ПО омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники.ИндСтроки = омг_УстановкаВыработкиНоменклатура.ИндСтроки
		|		ПО омг_УстановкаВыработкиФилиалы.Ссылка = омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники.Ссылка
		|ГДЕ
		|	омг_УстановкаВыработкиФилиалы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Филиал,
		|	Должность,
		|	Сотрудник,
		|	Номенклатура"; 
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	НомерЗаписи = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	//Если не ВыборкаДетальныеЗаписи.ЭтоГруппа Тогда
		НомерЗаписи = НомерЗаписи + 1;
		новЗапись = Движения.омг_НоменклатураВыработки.Добавить();
		ЗаполнитьЗначенияСвойств(новЗапись,ВыборкаДетальныеЗаписи); 
		новЗапись.НомерЗаписи = НомерЗаписи; 
	//Иначе
	//	
	//	Для каждого строка из ВернутьНоменклатуруПоПапке(ВыборкаДетальныеЗаписи.Номенклатура) Цикл
	//		
	//		СтрДвижения = Движения.омг_НоменклатураВыработки.Добавить();	
	//		ЗаполнитьЗначенияСвойств(СтрДвижения,ВыборкаДетальныеЗаписи);
	//		СтрДвижения.Номенклатура = строка;
	//	
	//	КонецЦикла;	
	//		
	//КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры     


Функция ВернутьНоменклатуруПоПапке(Папка)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&Папка)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Папка", Папка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции
